<?php
//โปรแกรมคำนวนหาพื้นที่ สี่เหลี่ยมผืนผ้า

$width = 20.5;
$length = 36.7;
$are = $width * $length;

echo ("ความกว้าง = " . $width . "<br>");
echo ("ความยาว= " . $length . "<br>");
echo ("พื้นที่สี่เหลี่ยมผืนผ้า = " . ($width*$length) . "ตารางเซนติเมตร");

//โปรแกรมคำนวนหาพื้นที่ สามเหลี่ยม
echo ("<br>โปรแกรมคำนวนหาพื้นที่  สามเหลี่ยม<br>");
$base = 30.5;
$height = 27.7;
$are = 0.5* $base * $height;

echo ("ฐาน = " . $base . "เซนติเมตร <br>");
echo ("สูง= " . $height . "เซนติเมตร <br>");
echo ("พื้นที่สามเหลี่ยม = " . ($base*$height) . "ตารางเซนติเมตร");

?>